InformationRegisters/ГрафикРаботКалендарный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботКалендарный</Name>
			<Comment>График работ календарный</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Банковский</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Comment>График</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидДня</Name>
			<Comment>Вид дня</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>Предпраздничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>Праздник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Выходной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
					<Comment>Сотрудник находится в командировке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Компания, к которой относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Comment>Месяц и число дня рождения сотрудника для сортировки списка по дням рождения. Формируется автоматически от даты рождения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольУРВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон</Name>
					<Comment>Номер внутреннего рабочего телефона сотрудника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефонСотовый</Name>
					<Comment>Корпоративный рабочий сотовый телефон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_ОкладДляМотивации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_Окладник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>telegramId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтчества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалённыйРежимРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийРаботы</Name>
					<Comment>Таблица подразделений, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийГК</Name>
					<Comment>Таблица подразделений Группы Компаний, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеГК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/Employee/Ext/Module.bsl
Функция Get(EmployeeGetRequest)
	// Вставить содержимое обработчика.
	EmployeeGetResponseType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "EmployeeGetResponse");
	EmployeeGetResponse = ФабрикаXDTO.Создать(EmployeeGetResponseType);   
	
	// Таблица для вызова функции общего назначения
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));
	DealerID = EmployeeGetRequest.TransactionHeader.DealerID;	
	Попытка
		IDСотрудника = EmployeeGetRequest.EmployeeGet.DMSEmployeeNo;
	Исключение
		IDСотрудника = "";   			
	КонецПопытки;
	
    Попытка
		ДатаИзмененийНачало = EmployeeGetRequest.EmployeeGet.LastModifiedDateTimeFromUTC;
	Исключение
		ДатаИзмененийНачало = Дата('00010101');
	КонецПопытки;        	
    Попытка
		ДатаИзмененийКонец = EmployeeGetRequest.EmployeeGet.LastModifiedDateTimeToUTC;
	Исключение
		ДатаИзмененийКонец = Дата('00010101');
	КонецПопытки;	
	Если ЗначениеЗаполнено(ДатаИзмененийНачало) Или ЗначениеЗаполнено(ДатаИзмененийКонец) Тогда
		EmployeeGetResponse = обПолучитьВозвратWAError("http://wa.dms.webservice/EmployeeGetRequest",EmployeeGetRequest,EmployeeGetResponse,"0",ТаблицаОщибок);  // функция общего назначения
		Возврат EmployeeGetResponse;  		
	КонецЕсли;
	
	// БЛОК КЛЮЧЕВОГО ПОИСКА
	Если ЗначениеЗаполнено(IDСотрудника) Тогда
		СотрудникСсылка = Справочники.Сотрудники.НайтиПоКоду(IDСотрудника);
		Если СотрудникСсылка.Пустая() Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Сотрудник с указанным кодом не найден";
			EmployeeGetResponse = обПолучитьВозвратWAError("http://wa.dms.webservice/EmployeeGetRequest", EmployeeGetRequest, EmployeeGetResponse,"-1",ТаблицаОщибок);
			Возврат EmployeeGetResponse;  		
		КонецЕсли;
	Иначе
		СотрудникСсылка = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(СотрудникСсылка) Тогда  		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК СотрудникСсылка
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.Ссылка = &СотрудникСсылка
		               |	И Сотрудники.Должность.КодРолиWA > 0
		               |	И Сотрудники.Должность.КодРолиWA < 5
		               |	И Сотрудники.Подразделение.ДилерИД = &ДилерИД";
		Запрос.УстановитьПараметр("ДилерИД",DealerID);	
		Запрос.Параметры.Вставить("СотрудникСсылка", СотрудникСсылка); 
		
	// Выяснить, нужно ли версионирование и в каких запросах!!!
	//ИначеЕсли ЗначениеЗаполнено(ДатаИзмененийНачало) ИЛИ ЗначениеЗаполнено(ДатаИзмененийКонец) Тогда	                                                                        
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	Версионирование.Идентификатор КАК СотрудникСсылка,
	//				   |	Версионирование.ПредставлениеМетаданных,
	//				   |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Версионирование.Автор) КАК Автор
	//				   |ИЗ
	//				   |	РегистрСведений.Версионирование КАК Версионирование
	//				   |ГДЕ
	//				   |	Версионирование.ДатаИзменения МЕЖДУ &ДатаНач И &ДатаКон
	//				   |	И Версионирование.ПредставлениеМетаданных = &СправочникСотрудники
	//				   |
	//				   |СГРУППИРОВАТЬ ПО
	//				   |	Версионирование.Идентификатор,
	//				   |	Версионирование.ПредставлениеМетаданных";
	//				   
	//	Запрос.Параметры.Вставить("ДатаНач", ?(обЗначениеНеЗаполнено(ДатаИзмененийНачало),Дата('00010101'),ДатаИзмененийНачало));            
	//	Запрос.Параметры.Вставить("ДатаКон", ?(обЗначениеНеЗаполнено(ДатаИзмененийКонец),Дата('20300101'),ДатаИзмененийКонец));
	//	Запрос.Параметры.Вставить("СправочникСотрудники","Справочник.Сотрудники"); 		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК СотрудникСсылка
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ
		               |	Сотрудники.Должность.КодРолиWA > 0
		               |	И Сотрудники.Должность.КодРолиWA < 5
		               |	И Сотрудники.Подразделение.ДилерИД = &ДилерИД";
		Запрос.УстановитьПараметр("ДилерИД",DealerID);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Количество()=0 Тогда                         		
		EmployeeGetResponse = обПолучитьВозвратWAError("http://wa.dms.webservice/EmployeeGetRequest",EmployeeGetRequest,EmployeeGetResponse,"0",ТаблицаОщибок);  // функция общего назначения
		Возврат EmployeeGetResponse;  		
	Иначе
		ArrayOfEmployeeDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "ArrayOfEmployee");
		ArrayOfEmployeeData = ФабрикаXDTO.Создать(ArrayOfEmployeeDataType);
		
		ПустаяДата = Дата(1, 1, 1);
		Пока Выборка.Следующий() Цикл 			
			Если ТипЗнч(Выборка.СотрудникСсылка)=Тип("СправочникСсылка.Сотрудники") Тогда	
				Сотрудник = Выборка.СотрудникСсылка;
			Иначе
				Сотрудник = Справочники.Сотрудники.ПолучитьСсылку(Выборка.СотрудникСсылка); // Строка(GUID) в регистре версионирования
			КонецЕсли;
			
			EmployeeDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "Employee");
			EmployeeData = ФабрикаXDTO.Создать(EmployeeDataType); 
			EmployeeData.DMSEmployeeNo = Сотрудник.Код;
			EmployeeData.LastName = обПолучитьФамилия(Сотрудник.Наименование);
			EmployeeData.MiddleName = обПолучитьОтчество(Сотрудник.Наименование);
			EmployeeData.FirstName = обПолучитьИмя(Сотрудник.Наименование);
			EmployeeData.FullName = Сотрудник.Наименование;
			EmployeeData.Salution = "";
			
			EmployeeData.Gender = "1";
			EmployeeData.Language = "ru";
			EmployeeData.SkillsetString = "";
			EmployeeData.Title = "";
			EmployeeData.MobileNumber = ПредставлениеТелефонаДляWA(Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
			Если обЗначениеНеЗаполнено(EmployeeData.MobileNumber) Тогда
				EmployeeData.MobileNumber = ПредставлениеТелефонаДляWA(Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
			КонецЕсли;
			EmployeeData.PhoneNumber = ПредставлениеТелефонаДляWA(Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
			EmployeeData.Email = киПолучитьПредставлениеКИ(Сотрудник, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			EmployeeData.LoginID = "";
			EmployeeData.LoginPassword = "";      			
			
			Если Сотрудник.ФлагУволен Тогда			
				EmployeeData.EmployeeStatus = "3";
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ГрафикРаботКалендарный.ВидДня,
				               |	ГрафикРаботКалендарный.Продолжительность
				               |ИЗ
				               |	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
				               |ГДЕ
				               |	ГрафикРаботКалендарный.График = &ГрафикСотрудника
				               |	И ГрафикРаботКалендарный.Дата = &ДатаЗапроса";
							   
				Запрос.Параметры.Вставить("ГрафикСотрудника",Сотрудник.ГрафикРаботы);
				Запрос.Параметры.Вставить("ДатаЗапроса",НачалоДня(ТекущаяДата()));
				Выб = Запрос.Выполнить().Выбрать();
				Если Выб.Количество()=0 Тогда
					EmployeeData.EmployeeStatus = "2"; // “1” – работает, “2” – выходной, “3” – уволен
				Иначе
					Выб.Следующий();
					Если Выб.ВидДня = Перечисления.ВидДня.Рабочий Тогда
						EmployeeData.EmployeeStatus = "1";
					Иначе
						EmployeeData.EmployeeStatus = "2";
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			EmployeeData.Group = "";
			
			//ПерваяЗапись = РегистрыСведений.Версионирование.ПолучитьПервое(,Новый Структура("Идентификатор, ПредставлениеМетаданных",Сотрудник.УникальныйИдентификатор(),Сотрудник.Метаданные().ПолноеИмя()));
			//ПоследняяЗапись = РегистрыСведений.Версионирование.ПолучитьПоследнее(,Новый Структура("Идентификатор, ПредставлениеМетаданных",Сотрудник.УникальныйИдентификатор(),Сотрудник.Метаданные().ПолноеИмя()));
			ManagementFieldsDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "ManagementFields");
			ManagementFieldsData = ФабрикаXDTO.Создать(ManagementFieldsDataType); 
			ManagementFieldsData.CreateDateTimeUTC = ПустаяДата;
			ManagementFieldsData.LastModifiedDateTimeUTC = ПустаяДата;
			EmployeeData.ManagementFields = ManagementFieldsData;
			
			ArrayOfRoleDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "ArrayOfRole");
			ArrayOfRoleData = ФабрикаXDTO.Создать(ArrayOfRoleDataType); 
			RoleDataType = ФабрикаXDTO.Тип("http://wa.dms.webservice/EmployeeGetRequest", "Role");
			RoleData = ФабрикаXDTO.Создать(RoleDataType);
			RoleData.RoleName = Строка(Сотрудник.Должность.КодРолиWA);
			RoleData.RoleUserID = "";
			ArrayOfRoleData.Role.Добавить(RoleData);
			
			EmployeeData.Roles = ArrayOfRoleData;         			
			ArrayOfEmployeeData.Employee.Добавить(EmployeeData);			
		КонецЦикла;     
	КонецЕсли;
	
	EmployeeGetResponse.Employees = ArrayOfEmployeeData;
	EmployeeGetResponse = обПолучитьВозвратWAError("http://wa.dms.webservice/EmployeeGetRequest",EmployeeGetRequest,EmployeeGetResponse,"1",ТаблицаОщибок);
	Возврат EmployeeGetResponse;  	
КонецФункции
